package codigoGals;

public interface ParserConstants {
    int START_SYMBOL = 43;

    int FIRST_NON_TERMINAL    = 43;
    int FIRST_SEMANTIC_ACTION = 81;

    int[][] PARSER_TABLE =
    {
        { -1, -1, -1, -1, -1, -1, -1,  0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1,  1, -1, -1, -1, -1, -1, -1,  1, -1, -1,  1, -1, -1, -1, -1,  1,  1,  1,  1, -1, -1,  1,  1, -1,  1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1,  3, -1, -1, -1, -1, -1, -1,  3, -1, -1,  3, -1, -1,  2, -1,  3,  3,  3,  3, -1, -1,  3,  3, -1,  3, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1,  5, -1, -1, -1, -1, -1, -1,  4, -1, -1,  5, -1, -1, -1, -1,  4,  5,  4,  4, -1, -1,  5,  5, -1,  4, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1,  6, -1, -1, -1, -1, -1, -1, -1, -1, -1, 10, -1, -1, -1, -1, -1,  9, -1, -1, -1, -1,  8,  7, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, 12, -1, -1, -1, -1, 12, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 11, 11, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 13, 14, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, 15, -1, -1, -1, -1, 16, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, 45, 45, 45, 45, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 45, -1, -1, -1, -1, 45, -1, -1, -1, -1, -1, 45, -1, 45, 45, -1, -1, -1, -1, -1, -1, -1, -1, 45, -1, -1, -1 },
        { -1, 17, 17, 17, 17, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 17, -1, -1, -1, -1, 17, -1, -1, -1, -1, -1, 17, -1, 17, 17, -1, -1, -1, -1, -1, -1, -1, -1, 17, -1, -1, -1 },
        { -1, 18, 18, 18, 18, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 18, -1, -1, -1, -1, 18, -1, -1, -1, -1, -1, 18, -1, 18, 18, -1, -1, -1, -1, -1, -1, -1, -1, 18, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, 22, -1, -1, -1, -1, -1, -1, -1, 20, -1, 19, -1, -1, -1, -1, -1, -1, 21, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, 23, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 24, 25 },
        { -1, -1, -1, -1, -1, -1, -1, -1, 26, -1, -1, -1, -1, -1, -1, -1, 26, -1, 26, 27, -1, -1, -1, -1, -1, 26, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 28, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 29, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, 30, -1, -1, 31, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 32, -1, 33 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 34, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, 35, 35, 35, 35, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 35, -1, -1, -1, -1, 35, -1, -1, -1, -1, -1, 35, -1, 35, 35, -1, -1, -1, -1, -1, -1, -1, -1, 35, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 36, -1, 37 },
        { -1, 38, -1, -1, -1, -1, -1, -1, -1, -1, -1, 38, -1, -1, -1, -1, -1, 38, -1, -1, -1, -1, 38, 38, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, 40, -1, -1, -1, -1, -1, -1, -1, -1, -1, 40, -1, 39, 39, -1, -1, 40, -1, -1, -1, -1, 40, 40, -1, -1, -1, 39, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 41, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 43, 42, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 44, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
        { -1, 46, -1, -1, -1, -1, 47, -1, -1, -1, -1, 46, -1, -1, -1, -1, -1, 46, -1, -1, -1, 48, 46, 46, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 46, 46, 46 },
        { -1, 49, 49, 49, 49, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 51, -1, -1, -1, -1, 52, -1, -1, -1, -1, -1, 50, -1, 49, 49, -1, -1, -1, -1, -1, -1, -1, -1, 49, -1, -1, -1 },
        { -1, 53, 53, 53, 53, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 53, 53, -1, -1, -1, -1, -1, -1, -1, -1, 53, -1, -1, -1 },
        { -1, 54, -1, -1, -1, -1, 54, -1, -1, -1, -1, 54, -1, -1, -1, -1, -1, 54, -1, -1, -1, 54, 54, 54, -1, -1, -1, -1, -1, -1, -1, -1, 55, 55, 55, 55, -1, -1, -1, 54, 54, 54 },
        { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 56, 57, 58, 59, -1, -1, -1, -1, -1, -1 },
        { -1, 60, 60, 60, 60, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 60, 60, -1, -1, -1, -1, -1, -1, -1, -1, 60, -1, -1, -1 },
        { -1, 61, -1, -1, -1, -1, 61, -1, -1, -1, -1, 61, -1, -1, -1, -1, -1, 61, -1, -1, -1, 61, 61, 61, -1, -1, -1, -1, 62, 63, -1, -1, 61, 61, 61, 61, -1, -1, -1, 61, 61, 61 },
        { -1, 64, 64, 64, 64, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 64, 64, -1, -1, -1, -1, -1, -1, -1, -1, 64, -1, -1, -1 },
        { -1, 65, -1, -1, -1, -1, 65, -1, -1, -1, -1, 65, -1, -1, -1, -1, -1, 65, -1, -1, -1, 65, 65, 65, -1, -1, -1, -1, 65, 65, 66, 67, 65, 65, 65, 65, -1, -1, -1, 65, 65, 65 },
        { -1, 68, 69, 70, 71, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 73, 74, -1, -1, -1, -1, -1, -1, -1, -1, 72, -1, -1, -1 },
        { -1, 75, -1, -1, -1, -1, 75, -1, -1, 76, -1, 75, 78, -1, -1, -1, -1, 75, -1, -1, -1, 75, 75, 75, 77, -1, -1, -1, 75, 75, 75, 75, 75, 75, 75, 75, -1, -1, -1, 75, 75, 75 }
    };

    int[][] PRODUCTIONS = 
    {
        { 181,   8,  44,  15, 182 }, // 100 101 ok
        {  46,  41,  45 },
        {   0 },
        {  44 },
        {  57 },
        {  47 },
        {   2, 202,  48 }, //121 ok
        {  59 },
        {  62 },
        {  67 },
        {  69 },
        {  49 },
        {  50 },
        {  37,  51, 203 }, //122 ok
        {  38,  51, 203 }, //122 ok
        {   6,  39,  52,  42,  53,  40 },
        {  11,  39,  53,  40 },
        {  51 },
        {  51 },
        {  19, 201 }, //120 ok
        {  17, 201 }, //120 ok
        {  26, 201 }, //120 ok
        {   9, 201 }, //120 ok
        {   2, 202,  56 }, //121 ok
        {   0 },
        {  42,  55 },
        {  54,  55, 200 }, //119 ok
        {  58,  55, 200 }, //119 ok
        {  20,  39,  54,  42,   3,  40 },
        {  24,  39,  60,  40 },
        {   2, 204,  61 }, //123 ok
        {   5, 205,  42,   2, 204,  61 }, //124 ok 123 ok
        {   0 },
        {  42,  60 },
        {  23,  39,  63,  40, 199 }, //118 ok
        {  51, 183,  64 }, //102 ok
        {   0 },
        {  42,  63 },
        {  47,  41,  66 },
        {   0 },
        {  65 },
        {  18,  51, 206,  65,  68 },//125 ok
        {  15, 207 },//128 ok
        {  14, 208,  65,  15, 207 }, //127 ok 126 ok
        {  12, 209,  65,  28,  51, 210 },//128 ok 129 ok
        {  71,  70 },
        {   0 },
        {   7,  71, 194,  70 },//113 ok
        {  22,  71, 195,  70 },//114 ok
        {  72 },
        {  27, 196 },//115 ok
        {  16, 197 },//116 ok
        {  21,  71, 198 },//117 ok
        {  75,  73 },
        {   0 },
        {  74, 192,  75, 193 },//111 112 ok ok
        {  33 },
        {  34 },
        {  35 },
        {  36 },
        {  77,  76 },
        {   0 },
        {  29,  77, 187,  76 }, //106 ok
        {  30,  77, 188,  76 },//107 ok
        {  79,  78 },
        {   0 },
        {  31,  79, 189,  78 },//108 ok
        {  32,  79, 190,  78 },//109 ok
        {   2, 211,  80 }, //130 ok
        {   3, 184 },//103 ok
        {   4, 185 },//104 ok
        {   5, 186 },//105 ok
        {  39,  51,  40 },
        {  29,  79 },
        {  30,  79, 191 }, //110 ok
        {   0 },
        {  10 },
        {  25 },
        {  13,  39,  51,  40 }
    };

    String[] PARSER_ERROR = {
            "",
            "esperado EOF", // "Era esperado fim de programa",
            "esperado identificador", // "Era esperado id",
            "esperado constante_int", // "Era esperado cint",
            "esperado constante_float", // "Era esperado cfloat",
            "esperado constante_string", // "Era esperado cstring",
            "esperado add", // "Era esperado pr_add",
            "esperado and", // "Era esperado pr_and",
            "esperado begin", // Era esperado pr_begin",
            "esperado bool", // "Era esperado pr_bool",
            "esperado count", // "Era esperado pr_count",
            "esperado delete", // "Era esperado pr_delete",
            "esperado do", // "Era esperado pr_do",
            "esperado elementOf", // "Era esperado pr_elementOf",
            "esperado else", // "Era esperado pr_else",
            "esperado end", // "Era esperado pr_end",
            "esperado false", // "Era esperado pr_false",
            "esperado float", // "Era esperado pr_float",
            "esperado if", // "Era esperado pr_if",
            "esperado int", // "Era esperado pr_int",
            "esperado list", // "Era esperado pr_list",
            "esperado not", // "Era esperado pr_not",
            "esperado or", // "Era esperado pr_or",
            "esperado print", // "Era esperado pr_print",
            "esperado read", // "Era esperado pr_read",
            "esperado size", // "Era esperado pr_size",
            "esperado string", // "Era esperado pr_string",
            "esperado true", // "Era esperado pr_true",
            "esperado until", // "Era esperado pr_until",
            "esperado +", // "Era esperado \"+\"",
            "esperado -", // "Era esperado \"-\"",
            "esperado *", // "Era esperado \"*\"",
            "esperado /", // "Era esperado \"/\"",
            "esperado ==", // "Era esperado \"==\"",
            "esperado ~=", // "Era esperado \"~=\"",
            "esperado <", // "Era esperado \"<\"",
            "esperado >", // "Era esperado \">\"",
            "esperado =", // "Era esperado \"=\"",
            "esperado <-", // "Era esperado \"<-\"",
            "esperado (", // "Era esperado \"(\"",
            "esperado )", // "Era esperado \")\"",
            "esperado ;", // "Era esperado \";\"",
            "esperado ,", // "Era esperado \",\"",
            "esperado begin", // "<programa> inválido",
            "esperado identificador tipo do if print read", // "<lista_instrucao> inválido",
            "esperado identificador tipo do end if print read", // "<lista_instrucao1> inválido",
            "esperado identificador tipo do if print read", // "<instrucao> inválido",
            "esperado identificador do if print read", // "<comando> inválido",
            "esperado add delete = <-", // "<comando1> inválido",
            "esperado = <-", // "<comando_atribuicao1> inválido",
            "esperado add delete", // "<comando_lista1> inválido",
            "esperado identificador constante_int constante_float constante_string false not true + - (", // "<expressao>
                                                                                                          // inválido",
            "esperado identificador constante_int constante_float constante_string false not true + - (", // "<elemento>
                                                                                                          // inválido",
            "esperado identificador constante_int constante_float constante_string false not true + - (", // "<posicao>
                                                                                                          // inválido",
            "esperado tipo primitivo", // "<tipo> inválido",
            "esperado identificador", // "<lista_identificador> inválido",
            "esperado ; ,", // "<lista_identificador1> inválido",
            "esperado tipo ", // "<declaracao_variavel> inválido",
            "esperado list", // "<lista> inválido",
            "esperado read", // "<entrada_dados> inválido",
            "esperado identificador constante_string", // "<lista_entrada> inválido",
            "esperado ) ,", // "<lista_entrada1> inválido",
            "esperado print", // "<saida_dados> inválido",
            "esperado expressao", // "<lista_expressao> inválido",
            "esperado ) ,", // "<lista_expressao1> inválido",
            "esperado comando", // "<lista_comando> inválido",
            "esperado comando else end until", // "<lista_comando1> inválido",
            "esperado if", // "<comando_selecao> inválido",
            "esperado else end", // "<comando_selecao1> inválido",
            "esperado do", // "<comando_repeticao> inválido",
            "esperado expressao", // "<expressao_> inválido",
            "esperado expressao", // "<valor> inválido",
            "esperado expressao", // "<relacional> inválido",
            "esperado expressao", // "<relacional_> inválido",
            "esperado == ~= < >", // "<operador_relacional> inválido",
            "esperado expressao", // "<aritmetica> inválido",
            "esperado expressao", // "<aritmetica_> inválido",
            "esperado expressao", // "<termo> inválido",
            "esperado expressao", // "<termo_> inválido",
            "esperado expressao", // "<fator> inválido",
            "esperado expressao", // "<fator_> inválido"
    };
}
